// package com.prvz.programyata.tasks.task1
//
// class BinarySearch {
//
//    fun search(arr: IntArray, find: Int): Boolean {
//
//        // 1. Узнаем размер массива.
//        // - если размер массива - четный, берем элемент справа
//        // 2. Получаем индекс среднего элемента в массиве. Присваиваем переменной A
//        // 3. Проверяем,
//        // если A больше искомого, то берем левую часть массива. Возвращаемся к шагу 1
//        // если A больше искомого, то берем правую часть массива. Возвращаемся к шагу 1
//        // если A равно искомому, то выводим true
//
//        var innerArray: IntArray = arr
//
//        while (true) {
//            b = b + 1
//            println(b)
//        }
//
//    }
//
//    fun searchRecursive(arr: IntArray, find: Int): Boolean {
//
//    }
//
//
// }
//
// fun main() {
//
//
//    BinarySearch().search(intArrayOf(1,2,3), 1)
//
//    // Получить массив чисел
//
//    // Получить число для поиска
//
//    // Вызвать функцию search
//
//    // Вывести результат выполнения функции
//
// }
